[
  {
    "title": "MLOps Engineer",
    "companyName": "Clarifai",
    "location": "Washington, DC",
    "description": "About the CompanyClarifai is a leading, full-lifecycle deep learning AI platform for computer vision, natural language processing, and audio recognition. We help organizations transform unstructured images, video, text, and audio data into structured data at a significantly faster and more accurate rate than humans would be able to do on their own. Founded in 2013 by Matt Zeiler, Ph.D. Clarifai has been a market leader in AI since winning the top five places in image classification at the 2013 ImageNet Challenge. Clarifai continues to grow with employees remotely based throughout the United States, Canada, Estonia, Argentina & India.We have raised $100M in funding to date, with $60M coming from our most recent Series C, and are backed by industry leaders like Menlo Ventures, Union Square Ventures, Lux Capital, New Enterprise Associates, LDV Capital, Corazon Capital, Google Ventures, NVIDIA, Qualcomm and Osage.Clarifai is proud to be an equal opportunity workplace dedicated to pursuing, hiring, and retaining a diverse workforce.The OpportunityNote: We are interested in every qualified candidate who is eligible to work in the United States. However, we are not able to sponsor visas for this particular opportunity, as we are looking for someone who is eligible for a Secret or Top Secret Clearance.Join our high-velocity, talented AI research and software engineering teams to build innovative Applied Computer Vision and Enterprise AI solutions addressing critical public sector problems. You will maintain data ingestion and model development pipelines with a strong focus on detail and testing, deploy cutting-edge AI algorithms into production, and build and maintain efficient pipeline tooling. This role allows you to make a significant impact on both the company and the broader AI field by solving challenging customer problems and integrating real-world ML Ops pipelines into the Clarifai platform.Key Responsibilities:Collaborate with scientists and engineers to enhance object detection, segmentation, tracking, and visual search capabilities and develop new products.Deploy production-ready models to customers and iteratively improve them based on feedback.Maintain our research ML infrastructure.Transition research projects from proof of concept to production.Integrate your work directly into Clarifai's AI orchestration platformImpactYou will drive customer acquisition and revenue growth, working closely with various teams across the company, including research, backend, infrastructure, product, frontend, and design. This role offers a unique opportunity to make a substantial impact on the company and the AI industry.Requirements3+ years of experience with Python, focusing on Machine Learning or Computer Vision (PyTorch/TensorFlow).Strong MLOps philosophy and experience with associated tooling (Git, CI/CD, Docker, Kubernetes, Kubeflow, Hydra).Experience building and maintaining CI/CD pipelines with an emphasis on DevOps best practices.3+ experience with large scale software development: testing, automation, system-design, performance optimization, concurrent development3+ years of cloud exposure: AWS, Google Cloud, Azure (at least one of them)Comfortable working in a shell environment.Experience working with complex existing codebases.Eligible to obtain a U.S. Secret Security Clearance (U.S. Citizenship)Great to HaveExperience in object detection and tracking. Experience with model export (Torchscript, TensorRT).Experience with Golang, relational databases.The salary hiring range for this position is $125,000 - $175,000 and flexible depending on relevant experience.",
    "postedDate": "2 weeks ago",
    "link": "https://www.linkedin.com/jobs/view/mlops-engineer-at-clarifai-3953818552?position=1&pageNum=0&refId=b98zVd8fywwKP6YE3dmx8g%3D%3D&trackingId=xH72QaZF5hM3dyDZii6oAg%3D%3D&trk=public_jobs_jserp-result_search-card"
  },
  {
    "title": "MLOps Engineer(NJ)",
    "companyName": "Tiger Analytics",
    "location": "New Jersey, United States",
    "description": "Tiger Analytics is looking for experienced Machine Learning Engineers to join our fast-growing advanced analytics consulting firm. Our employees bring deep expertise in Machine Learning, Data Science, and AI. We are the trusted analytics partner for multiple Fortune 500 companies, enabling them to generate business value from data. Our business value and leadership has been recognized by various market research firms, including Forrester and Gartner.We are looking for top-notch talent as we continue to build the best global analytics consulting team in the world. You will be responsible for:ML Engineer with 5-7 years of IT experiencePipeline Training Models, Building, Deployment, Testing, and Monitoring using AWS SageMaker, AWS CFT, AWS CodePipeline, Lambda, etcDevelop Airflow DAGs to run training and scoring pipelinesDevelop a Testing framework with Pytest Implement monitoring solution with homebrew solution using Lambda and Dash Develop Data Quality solutions potentially leveraging Great ExpectationsRequirementsBachelor's degree or higher in computer science or related, with 5+ years of work experienceAbility to collaborate with Data Engineers and Data Scientists to build data and model pipelines and help run machine learning tests and experimentsExperience in AWS - SageMaker (ProcessingJobs, TrainingModels, EndPoints)Experience in Lambda CloudFormation or Terraform Apache Airflow, Astronomer Docker Knowledge of traditional ML ModelsPython, Spark, Hadoop, and Docker with an emphasis on good coding practices in a continuous integration context, model evaluation, and experimental designKnowledge of ML frameworks like Scikitlearn, Tensorflow, and KerasExperience in Pandas, sklearn, Numpy, ScipyAdditional Skills RequiredKnowledge of Database/Data EngineeringExperience with Oracle, Spark, Hadoop, Athena, API, FastAPI, Flask, ReSTKnowledge of MLflow, Airflow, and KubernetesExperience with Cloud environments and knowledge of AWS Services, Service Catalog, SNS, SESBenefitsThis position offers an excellent opportunity for significant career development in a fast-growing and challenging entrepreneurial environment with a high degree of individual responsibility.",
    "postedDate": "9 months ago",
    "link": "https://www.linkedin.com/jobs/view/mlops-engineer-nj-at-tiger-analytics-3719415004?position=2&pageNum=0&refId=b98zVd8fywwKP6YE3dmx8g%3D%3D&trackingId=4A3%2Ff9MmNdIcytb6MRxdIQ%3D%3D&trk=public_jobs_jserp-result_search-card"
  },
  {
    "title": "N/A",
    "companyName": "N/A",
    "location": "N/A",
    "description": "N/A",
    "postedDate": "N/A",
    "link": "https://www.linkedin.com/jobs/view/mlops-developer%C2%A0-at-software-technology-inc-3792378653?position=3&pageNum=0&refId=b98zVd8fywwKP6YE3dmx8g%3D%3D&trackingId=oPQeYFtBkGD1dVTg04KCQQ%3D%3D&trk=public_jobs_jserp-result_search-card"
  },
  {
    "title": "N/A",
    "companyName": "N/A",
    "location": "N/A",
    "description": "N/A",
    "postedDate": "N/A",
    "link": "https://www.linkedin.com/jobs/view/mlops-engineer-at-addsource-3929079753?position=4&pageNum=0&refId=b98zVd8fywwKP6YE3dmx8g%3D%3D&trackingId=WxnnIaQfr59U9mHOLvNBSA%3D%3D&trk=public_jobs_jserp-result_search-card"
  },
  {
    "title": "N/A",
    "companyName": "N/A",
    "location": "N/A",
    "description": "N/A",
    "postedDate": "N/A",
    "link": "https://www.linkedin.com/jobs/view/mlops-engineer-at-clarifai-3952878718?position=5&pageNum=0&refId=b98zVd8fywwKP6YE3dmx8g%3D%3D&trackingId=FFF8%2BGozdIWlk%2FH4sORLNg%3D%3D&trk=public_jobs_jserp-result_search-card"
  },
  {
    "title": "N/A",
    "companyName": "N/A",
    "location": "N/A",
    "description": "N/A",
    "postedDate": "N/A",
    "link": "https://www.linkedin.com/jobs/view/mlops-engineer-grand-rapids-mi-at-software-technology-inc-3941634235?position=6&pageNum=0&refId=b98zVd8fywwKP6YE3dmx8g%3D%3D&trackingId=FXSmmF7Iymrj4N%2BYBZ2I0g%3D%3D&trk=public_jobs_jserp-result_search-card"
  },
  {
    "title": "Junior MLOps Tester",
    "companyName": "TekIntegral",
    "location": "Westbrook, ME",
    "description": "Title: ML Software Engineer x2 openingsVisa: Any except H1B and OPT/CPTLocation: Prioritizing candidates in the Boston area who can travel to Westbrook, Maine once a month Mode of Interview: Video 2 roundsData science & pathologist - build visualizations for domain users - Web development - D3.js - image data - clinical information Python programming ML teck-stacks - DataBricks - Amazon EC2, S3 - Docker, Kubernetes Working closely with DS in PieTorch - nice to have Data sets interfacing with - large-scale data sets - Computer vision background - would be nice - leaning more towards python programming",
    "postedDate": "2 months ago",
    "link": "https://www.linkedin.com/jobs/view/junior-mlops-tester-at-tekintegral-3888465092?position=7&pageNum=0&refId=b98zVd8fywwKP6YE3dmx8g%3D%3D&trackingId=aDrkiFpbgeDk%2BTM8bGGYBw%3D%3D&trk=public_jobs_jserp-result_search-card"
  },
  {
    "title": "MLOps Engineer",
    "companyName": "GyanSys Inc.",
    "location": "Ann Arbor, MI",
    "description": "GyanSys is looking for MLOps Engineer for its direct client on C2C. This is hybrid role. Please share consultants only on your W2.Location: Ann Arbor, Michigan Azure ML and related Azure technologiesStrong programming skills in languages such as Python, Java, or ScalaResponsibilities:• Design, implement, and maintain end-to-end machine learning pipelines for model training, validation, and deployment.• Collaborate with data scientists, software engineers, and DevOps engineers to integrate machine learning models into production systems.• Develop automation tools and frameworks to streamline the machine learning workflow, including data preprocessing, feature engineering, model training, and evaluation.• Optimize model performance and scalability by leveraging cloud computing resources and distributed computing techniques.• Implement monitoring and logging solutions to track model performance, data quality, and system health in production.• Manage model versioning, experimentation, and reproducibility using version control systems and experiment tracking tools.• Stay up to date with the latest trends and technologies in machine learning, cloud computing, and software engineering, and incorporate them into the MLOps workflow.• Provide technical guidance and mentorship to junior team members on best practices for MLOps. Required Skillset:• Strong programming skills in languages such as Python, Java, or Scala.• Proven experience as an MLOps Engineer, specifically with Azure ML and related Azure technologies.• Familiarity with containerization technologies such as Docker and orchestration tools like Kubernetes.• Proficiency in automation tools like JIRA, Ansible, Jenkins, Docker compose, Artifactory, etc. • Knowledge of DevOps practices and tools for continuous integration, continuous deployment (CI/CD), and infrastructure as code (IaC).Bachelor's degree or higher in computer science, engineering, mathematics, or related field. About GyanSysGyanSys Inc is a global systems integrator & solutions provider focused on providing strategic business process, technology, platform, and managed service solutions. As a recognized innovator in digital and process transformation, we specialize in SAP and Salesforce implementations, managed services, and analytics. We integrate cutting edge solutions in complex multi-cloud environments to optimize operations and to maximize return on investment. With over 1500 consultants, we are headquartered in Indianapolis USA, with delivery centers in Bangalore, India and Manilla, Philippines.",
    "postedDate": "2 weeks ago",
    "link": "https://www.linkedin.com/jobs/view/mlops-engineer-at-gyansys-inc-3955720424?position=8&pageNum=0&refId=b98zVd8fywwKP6YE3dmx8g%3D%3D&trackingId=UQlo1tUdH2IJ8lrF%2BZE0bA%3D%3D&trk=public_jobs_jserp-result_search-card"
  },
  {
    "title": "MLOps Internship",
    "companyName": "Subconscious AI",
    "location": "New York, NY",
    "description": "Company DescriptionSubconscious AI is a technology company that allows users to conduct causal experiments for any human behavior at a fraction of the cost and time of traditional methods. Our mission is to help people conduct research faster, with higher quality, and more ethically.We're looking for talented individuals who share our values and are excited to take part in this cutting-edge field.This role would potentially qualify recent graduates for full-time engineering.Role DescriptionThis is an internship role for a Machine Learning Operations Engineer. As an MLOps Engineer at Subconscious AI, you will be responsible for learning to develop and maintain both the front-end and back-end of our research platform. Your day-to-day tasks will be to learn to implement new features and work with our team to develop creative solutions to complex problems. You will also be expected to learn the latest technologies and work collaboratively with other members of our team to continuously improve our product.Key ResponsibilitiesLearn to develop and maintain scalable server-side logic using Python.Learn how to implement industrial-grade APIs.Write reusable, testable, and efficient code.QualificationsBachelor’s degree in Computer Science, Engineering or a related field, or equivalent experience.1+ years of experience in Python development.Curiosity about Causality, LLMs, and Operational tools like EconML and Weights and BiasesExperience with cloud platforms (e.g., GCP, Azure), CI/CD pipelines, and Github.Excellent communication and teamwork skills.Great attention to detail and organizational skills.Nice to HaveExperience with Python, Github, OpenAPI, RabbitMQ, R, Langchain, Autogen, React, WANDB, Meilisearch, Causalx, Llama, OpenAI, OpenAPI, Cohere, GCP & Azure.",
    "postedDate": "2 months ago",
    "link": "https://www.linkedin.com/jobs/view/mlops-internship-at-subconscious-ai-3934993443?position=9&pageNum=0&refId=b98zVd8fywwKP6YE3dmx8g%3D%3D&trackingId=6C9SwRvrZfjVU6noqsNDeg%3D%3D&trk=public_jobs_jserp-result_search-card"
  },
  {
    "title": "N/A",
    "companyName": "N/A",
    "location": "N/A",
    "description": "N/A",
    "postedDate": "N/A",
    "link": "https://www.linkedin.com/jobs/view/machine-learning-operations-mlops-engineer-at-artmac-3962782771?position=10&pageNum=0&refId=b98zVd8fywwKP6YE3dmx8g%3D%3D&trackingId=eOVJsyEN0FPG96g%2BGGDIfg%3D%3D&trk=public_jobs_jserp-result_search-card"
  },
  {
    "title": "N/A",
    "companyName": "N/A",
    "location": "N/A",
    "description": "N/A",
    "postedDate": "N/A",
    "link": "https://www.linkedin.com/jobs/view/data-engineer-mlops-at-webologix-ltd-inc-3968603851?position=11&pageNum=0&refId=b98zVd8fywwKP6YE3dmx8g%3D%3D&trackingId=iKnpoNjKDf8PI3BMD4gGlA%3D%3D&trk=public_jobs_jserp-result_search-card"
  },
  {
    "title": "N/A",
    "companyName": "N/A",
    "location": "N/A",
    "description": "N/A",
    "postedDate": "N/A",
    "link": "https://www.linkedin.com/jobs/view/mlops-engineer-at-adlib-recruitment-b-corp%E2%84%A2-3939083134?position=12&pageNum=0&refId=b98zVd8fywwKP6YE3dmx8g%3D%3D&trackingId=oAFdC6pl%2B8UadZtxJAdz1A%3D%3D&trk=public_jobs_jserp-result_search-card"
  },
  {
    "title": "N/A",
    "companyName": "N/A",
    "location": "N/A",
    "description": "N/A",
    "postedDate": "N/A",
    "link": "https://www.linkedin.com/jobs/view/remote-opportunity-mlops-engineer-at-spar-information-systems-llc-3806322039?position=13&pageNum=0&refId=b98zVd8fywwKP6YE3dmx8g%3D%3D&trackingId=pEsxFlTzrqzWaSrJz9yt8g%3D%3D&trk=public_jobs_jserp-result_search-card"
  },
  {
    "title": "LLMOps/MLOps",
    "companyName": "CitiusTech",
    "location": "United States",
    "description": "Our vision: -To inspire new possibilities for the health ecosystem with technology and human ingenuity. We envision a world where MLOps and LLM Ops empower us to unlock the full potential of ML and LLMs, accelerating innovation and delivering real-world impact.What is in it for you?As a Subject Matter Expert - ML or LLM Ops, you will be a hands-on person help implement Organization MLOps and LLMOps strategy and overseeing the development of scalable infrastructure and processes.Be an Architect of Innovation:This is your opportunity to join a dynamic team and leverage your expertise as an MLOps & LLM Ops Engineer. You'll play a pivotal role in designing and implementing robust pipelines for our ML and LLM models, ensuring efficient deployment and continuous optimization.Responsibilities: -· Work with senior architects to drive the strategic direction and technical leadership for MLOps and LLM Ops initiatives and ensure alignment with business objectives.· Demonstrate an in-depth understanding of MLOps and LLM Ops principles, including data pipelines, model training, deployment frameworks, and monitoring techniques.· Design, develop, and implement robust MLOps and LLM Ops pipelines for efficient model training, deployment, and monitoring.· Collaborate with cross-functional teams (engineering, data science, product) to ensure seamless integration of ML and LLM models into production workflows.· Communicate complex technical concepts clearly to both technical and non-technical audiences.· Stay at the forefront of MLOps and LLM Ops advancements and identify and champion new tools and best practices.Experience: -· 5- 7 Years in DevOps/ MLOps with enterprise grade modelOps· 6 months- year in LLMOpsEducational Qualifications: -· Any Bachelor/ master's degree in computer science, Data Science, or a related field (or equivalent experience).Skills: -Mandatory Technical skills· Must be abreast with CSP’s (AWS, Azure and GCP) MLOPS and LLOPS stack. GCP preferred.· Should have expert level knowledge around deploying AI stack on Kubernetes cluster and scaling the same both horizontal and vertical.· Must have experience on deploying AI applications using native services.· Must have experience on VM provisioning and network set up· Minimum over 5 years of experience in MLOps or LLM Ops along with a proven track record of successful deployments.· In-depth knowledge of MLOps tools and platforms such as Kubernetes, Docker, Jenkins, Git, MLflow, LLM-specific tooling.· Familiarity with Cloud platforms (AWS, Azure, Google Cloud) and infrastructure as code (IaC) principles.· Experience in DevOps methodologies and CI/CD pipelines.· Strong understanding of machine learning pipelines, model training frameworks, and monitoring techniques.· Experience in large language models (LLMs) and their unique operational considerations is a plus.Good to have skills: -· Excellent communication, collaboration, and problem-solving skills.· Ability to translate technical concepts into clear and concise language.· A passion for innovation and a drive to optimize ML and LLM workflows.· Written and verbal skills especially to confidently express technical ideas and solutions.Life at CitiusTechWe focus on building highly motivated engineering teams and thought leaders with an entrepreneurial mindset, centered on our core values of Passion, Respect, Openness, Unity, and Depth (PROUD) of knowledge. Our success lies in creating a fun, transparent, non-hierarchical, diverse work culture that focuses on continuous learning and work-life balance.Rated by our employees as the ‘Great Place to Work for’ according to the Great Place to Work survey. We offer you a comprehensive set of benefits to ensure that you have a long and rewarding career with us.Our EVPBe You Be Awesome is our EVP and it reflects our continuing efforts to create CitiusTech as a great place to work where our employees can thrive, both personally and professionally. It encompasses the unique benefits and opportunities we offer to support your growth, well-being, and success throughout your journey with us and beyond. Together with our clients, we are solving some of the greatest healthcare challenges and positively impacting human lives. Welcome to the world of Faster Growth, Higher Learning, and Stronger Impact.Join CitiusTech. Be You. Be Awesome. To learn more about CitiusTech, visit www.citiustech.com and follow us on social media.",
    "postedDate": "2 days ago",
    "link": "https://www.linkedin.com/jobs/view/llmops-mlops-at-citiustech-3966478655?position=14&pageNum=0&refId=b98zVd8fywwKP6YE3dmx8g%3D%3D&trackingId=GiIV37EYAcwHXibyXWqR1Q%3D%3D&trk=public_jobs_jserp-result_search-card"
  },
  {
    "title": "Senior MLOps Engineer",
    "companyName": "Gratiture Solutions",
    "location": "United States",
    "description": "Job DescriptionSenior MLOps EngineerA well-established company that is determined to become the most consumer-centric health organization by leveraging cutting-edge technologies and innovations, is looking for a Senior MLOps Engineer. The engineer will play an instrumental role in deploying robust, scalable machine learning solutions. The candidate will ensure these are tailored to meet the expansive needs of varied healthcare services. The company is driving a transformation in health care by expanding their footprint and providing more accessible, supportive, and personalized care. This role demands a high level of proficiency in machine learning technologies and programming, coupled with rigorous vetting processes to maintain the highest standards of data integrity and security.Required Skills: Natural Language Processing (NLP) 3 YOE Tensorflow OR PyTorch 1 YOE Pandas OR Scipy OR Numpy 1 YOEVisa Independent ( Non sponsorship position) Location : Remote and EST time zone Start date for role: 20th May, ‘24Job Responsibilities: Rapidly develop and deploy production-ready ML models, with a focus on scalability and monitoring across a broad range of applications within healthcare Write efficient, maintainable, and scalable Python code tailored to specific business needs Build high-performance, multi-tenant deployment architectures, and sophisticated model monitoring systems Directly engage with internal stakeholders to incorporate feedback and refine the ML-driven products through quick iteration cycles Uphold stringent security protocols and processes in the deployment and maintenance of machine learning models Drive the continuous advancement of MLOps practices within the healthcare industry by developing innovative solutions and advocating for best practicesJob Requirements: Bachelor’s/Master’s degree in Engineering, Computer Science (or equivalent experience) At least 5+ years of relevant experience as an MLOps Engineer At least 3+ years of experience with transformer-based models and NLP, preferably in a healthcare context Strong track record of fine-tuning, running large-scale training jobs, and managing model servers like vLLM, TGI, or TorchServe Proficiency in data science tools such as Pandas, Notebooks, Numpy, and Scipy Demonstrable experience with both relational and non-relational databases Extensive experience with TensorFlow or PyTorch, and familiarity with HuggingFace Knowledge of model analysis and experimentation frameworks such as MLFlow, W&B, and tfma is preferred Comfortable with a Linux environment and stringent data security practices Must pass a rigorous vetting process, including extensive background checks to ensure the highest standards of data security and integrity Fluent in English communication, both written and spoken. Company DescriptionWe strive to provide the highest quality recruitment, screening, and customer service to help grow exceptional teams as well as assist professionals advance in their desired careers. Integration is at the heart of digital transformation, and Our initiatives are designed to help customers across industries accelerate time to market with our agile workforce. Our Core team includes domain experts from multiple industries with thorough knowledge and understanding of the essential aspects of any IT demand.We strive to provide the highest quality recruitment, screening, and customer service to help grow exceptional teams as well as assist professionals advance in their desired careers. Integration is at the heart of digital transformation, and Our initiatives are designed to help customers across industries accelerate time to market with our agile workforce. Our Core team includes domain experts from multiple industries with thorough knowledge and understanding of the essential aspects of any IT demand.",
    "postedDate": "1 month ago",
    "link": "https://www.linkedin.com/jobs/view/senior-mlops-engineer-at-gratiture-solutions-3924151205?position=15&pageNum=0&refId=b98zVd8fywwKP6YE3dmx8g%3D%3D&trackingId=hsd1D3m1%2FW6QGSSlWrIM7w%3D%3D&trk=public_jobs_jserp-result_search-card"
  },
  {
    "title": "MLOps Engineer",
    "companyName": "Glassbeam, Inc",
    "location": "Santa Clara, CA",
    "description": "Glassbeam's mission is to enable smarter hospitals and labs with ML-powered products. Our products enable better medical device management, maintenance, and troubleshooting.As a startup, we provide a positive work environment. No bureaucracy. No useless meetings. Clear goals and clarity of purpose. Spend your day building something useful and get satisfaction from work. We empower you to take ownership. You will be encouraged to come up with and try new ideas. Get a sense of achievement from delivering innovative products and playing an important role in the growth and success of a startup.If you are an experienced MLOps engineer who enjoys working in a startup environment and deliveringinnovative products that customers use daily, we would love to hear from you.RoleProductionize ML models. Manage model lifecycle. Build ML-powered SaaS products running on AWS, Azure,and other clouds.The Ideal Candidate Has experience building production-grade ML training/ inference pipelines for a SaaS company Takes ownership of the goals assigned and gets things done Strives to develop scalable, maintainable, and reliable softwareResponsibilities Develop and maintain ML training pipeline Develop and maintain ML inference pipeline Develop tools for ML model deployment and lifecycle management Develop tools for managing ML pipeline/models Develop tools for monitoring ML pipeline/models Develop plans for both pipeline and model verification/validation Develop tools for ensuring robustness/correctness of ML pipelines/models under all scenariosRequirementsMinimum 5+ years’ experience developing and deploying in production scalable and reliable SaaS products 3+ experience developing micro-services architecture-based SaaS products 3+ years’ experience building production-grade SaaS products using Scala 1+ years’ work experience with Spark, HDFS and Kafka Strong design and programming skills Demonstrated adherence to writing unit tests Experience developing software using SCRUM methodologyPlus Hands-on experience with Cassandra, Play framework, Vertica, Delta Lake Work experience with Dockers, Kubernetes, Kubeflow, Airflow, Dagster Experience deploying production-grade ML software on AWS, Azure, Google Cloud Experience building web apps using Angular or React",
    "postedDate": "1 year ago",
    "link": "https://www.linkedin.com/jobs/view/mlops-engineer-at-glassbeam-inc-3349007309?position=16&pageNum=0&refId=b98zVd8fywwKP6YE3dmx8g%3D%3D&trackingId=pH9Co839lUMU53vyy8ji8Q%3D%3D&trk=public_jobs_jserp-result_search-card"
  },
  {
    "title": "N/A",
    "companyName": "N/A",
    "location": "N/A",
    "description": "N/A",
    "postedDate": "N/A",
    "link": "https://www.linkedin.com/jobs/view/mlops-engineer-mahin-job-32325-at-keylent-inc-3862184692?position=17&pageNum=0&refId=b98zVd8fywwKP6YE3dmx8g%3D%3D&trackingId=%2F0hZn%2FyWHk3TNTPN2bCo6g%3D%3D&trk=public_jobs_jserp-result_search-card"
  },
  {
    "title": "N/A",
    "companyName": "N/A",
    "location": "N/A",
    "description": "N/A",
    "postedDate": "N/A",
    "link": "https://www.linkedin.com/jobs/view/devops-sre-with-mlops-experience-at-applab-systems-inc-3965448884?position=18&pageNum=0&refId=b98zVd8fywwKP6YE3dmx8g%3D%3D&trackingId=GfrDdQM70n6JZEg0ypTT8w%3D%3D&trk=public_jobs_jserp-result_search-card"
  },
  {
    "title": "N/A",
    "companyName": "N/A",
    "location": "N/A",
    "description": "N/A",
    "postedDate": "N/A",
    "link": "https://www.linkedin.com/jobs/view/mlops-engineer-at-mavinsys-3952669251?position=19&pageNum=0&refId=b98zVd8fywwKP6YE3dmx8g%3D%3D&trackingId=yqCM8ack6j5Y58%2BppX7qYw%3D%3D&trk=public_jobs_jserp-result_search-card"
  },
  {
    "title": "N/A",
    "companyName": "N/A",
    "location": "N/A",
    "description": "N/A",
    "postedDate": "N/A",
    "link": "https://www.linkedin.com/jobs/view/machine-learning-at-tekvivid-inc-3966690925?position=20&pageNum=0&refId=b98zVd8fywwKP6YE3dmx8g%3D%3D&trackingId=xq0DpAZZMkCbD8fiIJelYg%3D%3D&trk=public_jobs_jserp-result_search-card"
  },
  {
    "title": "Software Engineer - ML Infrastructure",
    "companyName": "Voxel",
    "location": "San Francisco, CA",
    "description": "Who Are WeIndustrial labor is incredibly dangerous work - almost 3 million people in the US per year are injured in the workplace for entirely preventable and at times, fatal or debilitating causes. Protecting these essential people who power our world is what motivates Voxelitos, and we'd love for you to join us. At Voxel, we're passionate about revolutionizing workplace safety and operations with groundbreaking, full-stack AI and computer vision technology.Voxel’s site intelligence platform helps safety and operations leaders see the unseen risks, make strategic decisions, and prevent workplace incidents before they happen. Our customers include Fortune 500 companies across major grocers and retailers, manufacturers, food and beverage warehousers, supply chain and logistics service providers. Based in SF with team members sitting all over the globe, Voxel is backed by industry leading VC’s.What You'll DoWe are seeking a highly motivated and bright engineer to join our team and devise elegant solutions to challenging problems. This role will focus on designing and implementing systems to support Voxel's ML development. As a part of the perception team, you should be comfortable working in a fast-paced environment and solving problems across the software stack. We require engineers to be versatile and possess the ability to move across projects and tackle new challenges.ResponsibilitiesBuild and maintain cloud infrastructure and distributed systems for MLOpsBuild out internal training framework to make research with large distributed models easy and funDesign and develop systems to support Voxel's ML development, with a focus on computer vision applicationsBuild distributed systems and pipelines for data management, ensuring scalability, reliability, and performanceDemonstrate a deep understanding of DevOps practices and apply them to ML operationsUtilize technologies such as Kubernetes and various CI/CD systems to optimize infrastructure deployment and managementContribute to the overall impact of Voxel's AI-powered workplace safety solutions by delivering robust and efficient ML infrastructure.Qualifications, Must-HavesBachelor's degree in Computer Science, Robotics or a related fieldSoftware development experience with proficiency in PythonAbility to solving complex and open-ended problemsNice-to-HavesPhD/Master’s degree in Computer Science, Robotics or a related field2 years of experience in software development, with a focus on infrastructure designExperience designing large, highly available distributed systems with KubernetesBackground in Computer vision or Machine LearningExperience shipping production software for MLOps / DevOps or other internal toolsWhy Join Us?Join a visionary team revolutionizing safety and operations, directly impacting the well-being of millions of essential workers. This is your chance to build an extraordinary business and foster a vibrant company culture that demands your absolute best. Alongside AI experts, experienced entrepreneurs, and passionate problem-solvers, you'll play a pivotal role in shaping the company's growth trajectory and market position. Enjoy a competitive salary, benefits, and a dynamic work environment.BenefitsExtensive / Generous health, dental, and vision insurance.Highly competitive paid parental leave and support system.Ownership in the business through an Equity Incentive Plan.Generous paid time off and / or flexible work arrangements.Daily meals in-office, vibrant company events, team-building.401K retirement plan, HSA options, pre-tax Commuter Card.",
    "postedDate": "1 day ago",
    "link": "https://www.linkedin.com/jobs/view/software-engineer-ml-infrastructure-at-voxel-3967391721?position=21&pageNum=0&refId=b98zVd8fywwKP6YE3dmx8g%3D%3D&trackingId=cUtTkcx4IMTXO%2Finbt%2BBHg%3D%3D&trk=public_jobs_jserp-result_search-card"
  },
  {
    "title": "MLOps Engineer",
    "companyName": "FinThrive",
    "location": "United States",
    "description": "Impact you will makeJoin a group of highly talented and motivated data scientists and data engineers with significant healthcare experience to help a thriving Healthcare function. Build a highly functional and efficient Data Science & Machine Learning platform that brings together data from disparate sources and allow FinThrive to design and run complex algorithms to provide insights into the Healthcare business operations. Partner with internal business, product, and technical teams to analyze requirements to deliver solutions to complex issues. Participate in development and oversee maintenance of code to ensure consistency, quality, best practices, and performance of applications.What you will doBe a key member of a growing team (data scientists, data engineers, DevOps engineers) that designs and implements predictive analytics solutions in a production environment, leveraging a variety of statistical models and machine learning algorithmsDeploy machine learning models into production environments. Integrate machine learning algorithms with existing systems and applicationDesign, build, and maintain the infrastructure for machine learning operationsCollaborate with DevOps teams to ensure scalability, reliability, and security of ML systemsImplement automation tools and processes for model training, testing, and deployment. Streamline and optimize the end-to-end machine learning lifecycleBuild tools and capabilities for model management and model performance monitoring Collaborate effectively with the team and across cross-functional stakeholdersModel a high-performance culture with critical thinking, problem-solving, learning, collaboration, and experimentation within the teamWhat you will bringBachelor's degree completed in Computer Science or a related field3+ years of experience with artificial intelligence, software engineering, MLOps, DevOps, or data engineering, in a professional roleExperience with Azure DevOps, CI/CD, Terraform, Python and other scripting languages Experience with integrating DevSecOps practices and principles throughout the project life cycleExperience with Big Data technologies, cloud-based analytics, non-relational datastores, data visualization tools, and open-source tools for data processingExperience with Agile methodologies (Scrum, Kanban) and project management tools such as Jira or Azure DevOps.Travel required: Minimal (a couple of time a year)What we would like to seeExperience with Databricks and Azure cloud platform, machine learning services, and best practicesExperience in open-source AI/ML tools, frameworks technologies (for example, TensorFlow, PyTorch, scikit-learn, Apache MXnet, Spark MLlib, etc.)Experience with predictive analytics in Healthcare, Insurance or Consumer Credit industryExperience with Databricks",
    "postedDate": "2 weeks ago",
    "link": "https://www.linkedin.com/jobs/view/mlops-engineer-at-finthrive-3956372884?position=22&pageNum=0&refId=b98zVd8fywwKP6YE3dmx8g%3D%3D&trackingId=U0gg7qwTPRwuaH9YOtuDvg%3D%3D&trk=public_jobs_jserp-result_search-card"
  },
  {
    "title": "MLOps Engineer",
    "companyName": "MashPoint - Technology & Staffing- merged with HuMetis group Inc",
    "location": "New York, NY",
    "description": "Job Title: MLOps EngineerDuration: FULL-TIMELocation: Pennsylvania, NYC, Need to Travel to any of these locations 2-3 weeks initially to understand the project after 3-4 days in a month.SummaryWe are seeking a highly skilled and experienced MLOps Engineer to join our team. You will play a crucial role in building and maintaining the infrastructure and pipelines for our cutting-edge Generative AI applications, working closely with the Generative AI Full Stack Architect. Your expertise in automating and streamlining the ML lifecycle will be instrumental in ensuring the efficiency, scalability, and reliability of our Generative AI models in production.ResponsibilitiesDesign, develop, and implement ML Ops pipelines for generative AI models, encompassing data ingestion, pre-processing, training, deployment, and monitoring.Automate ML tasks across the model lifecycle, leveraging tools like Git Ops, CI/CD pipelines, and containerization technologies (e.g., Docker, Kubernetes).Develop and maintain robust monitoring and alerting systems for generative AI models in production, ensuring proactive identification and resolution of issues.Collaborate with the Generative AI Full Stack Architect and other engineers to optimize model performance and resource utilization.Manage and maintain cloud infrastructure (e.g., AWS, GCP, Azure) for ML workloads, ensuring cost-efficiency and scalability.Stay up to date on the latest advancements in ML Ops and incorporate them into our platform and processes.Communicate effectively with technical and non-technical stakeholders about the health and performance of generative AI models.QualificationsBachelor's degree in Computer Science, Data Science, Engineering, or a related field, or equivalent experience.7+ years of experience in ML Ops or related areas, such as DevOps, data engineering, or ML infrastructure.Proven experience in automating ML pipelines with tools like ML flow, Kubeflow, Airflow, etc.Expertise in cloud platforms (e.g., AWS, Azure) for ML workloads.Strong understanding of CI/CD principles and containerization technologies like Docker and Kubernetes.Familiarity with monitoring and alerting tools for ML systems (e.g., Prometheus, Grafana).Excellent communication, collaboration, and problem-solving skills.Ability to work independently and as part of a team.Passion for Generative AI and its potential to revolutionize various industries.Senior individual contributor with significant expertise and leadership experience.Manages complex projects and initiatives with independent decision-making authority.Provides technical guidance and mentoring to junior team members.Has a proven track record of success in delivering impactful results.",
    "postedDate": "2 months ago",
    "link": "https://www.linkedin.com/jobs/view/mlops-engineer-at-mashpoint-technology-staffing-merged-with-humetis-group-inc-3888429429?position=23&pageNum=0&refId=b98zVd8fywwKP6YE3dmx8g%3D%3D&trackingId=nJ2QXz3kAjNwaVvcrrBepg%3D%3D&trk=public_jobs_jserp-result_search-card"
  },
  {
    "title": "N/A",
    "companyName": "N/A",
    "location": "N/A",
    "description": "N/A",
    "postedDate": "N/A",
    "link": "https://www.linkedin.com/jobs/view/sr-mlops-engineer-at-warrior-tech-solutions-3803195090?position=24&pageNum=0&refId=b98zVd8fywwKP6YE3dmx8g%3D%3D&trackingId=Gw%2BNMP3ajZV1faK5khrEZQ%3D%3D&trk=public_jobs_jserp-result_search-card"
  },
  {
    "title": "N/A",
    "companyName": "N/A",
    "location": "N/A",
    "description": "N/A",
    "postedDate": "N/A",
    "link": "https://www.linkedin.com/jobs/view/mlops-enginieer-at-vrk-it-vision-inc-3951768364?position=25&pageNum=0&refId=b98zVd8fywwKP6YE3dmx8g%3D%3D&trackingId=73Ml9qkqVJhnV2d7e%2BUGew%3D%3D&trk=public_jobs_jserp-result_search-card"
  },
  {
    "title": "N/A",
    "companyName": "N/A",
    "location": "N/A",
    "description": "N/A",
    "postedDate": "N/A",
    "link": "https://www.linkedin.com/jobs/view/machine-learning-operations-mlops-engineer-aws-with-llm-focus-at-vakula-technologies-inc-3961585224?position=26&pageNum=0&refId=b98zVd8fywwKP6YE3dmx8g%3D%3D&trackingId=l56BiJd6nDg3JLdqkjiP4w%3D%3D&trk=public_jobs_jserp-result_search-card"
  },
  {
    "title": "N/A",
    "companyName": "N/A",
    "location": "N/A",
    "description": "N/A",
    "postedDate": "N/A",
    "link": "https://www.linkedin.com/jobs/view/sr-mlops-engineer-dallas-tx-onsite-role-at-strategism-inc-3829380271?position=27&pageNum=0&refId=b98zVd8fywwKP6YE3dmx8g%3D%3D&trackingId=TDvo8Z%2Bb5NUEE1T6ZHeZ%2FA%3D%3D&trk=public_jobs_jserp-result_search-card"
  },
  {
    "title": "MLOps Engineer",
    "companyName": "Triunity Software, Inc.",
    "location": "Austin, TX",
    "description": "Title: MLOps EngineerLocation: Austin TX or San Jose CA- RemoteJD: The MLOps engineer should have 5+ years of experience in Python Pandas, Spark and will have experience building large-scale data pipelines Experience in Seldon, Triton, Jenkin CI/CD One year of experience in Big data technologies such as BigQuery, Hadoop, SQL, Hive, GCP/Azure, Java, REST (nice to have)In your day-to-day responsibilities: Design & create the data pipelines and engineering infrastructure to support our clients’ enterprise machine learning systems at scale Take models that data scientists built and turn them into a machine learning production system Develop and deploy scalable tools and services for our clients to handle machine learning training and inference Identify and evaluate new technologies to improve the performance, maintainability, and reliability of our clients’ machine learning systems Apply software engineering rigor and best practices to machine learning, including CI/CD, automation, etc. Support model development with an emphasis on auditability, versioning, model measurement and data security Interpret the results of the models, read data on a fundamental level, and understand how it relates to the problem being solved by the model. Monitor the performance of your models, and need to be able to troubleshoot any errors or bugs that may occur.This is a remote position.",
    "postedDate": "2 weeks ago",
    "link": "https://www.linkedin.com/jobs/view/mlops-engineer-at-triunity-software-inc-3952359325?position=28&pageNum=0&refId=b98zVd8fywwKP6YE3dmx8g%3D%3D&trackingId=f2hAm1o%2BILrEbgkgP3tY1Q%3D%3D&trk=public_jobs_jserp-result_search-card"
  },
  {
    "title": "ML Operations Engineer (MLOps)",
    "companyName": "Unreal Staffing, Inc",
    "location": "San Francisco, CA",
    "description": "Company Overview: Welcome to the forefront of machine learning operations! At our company, we're driving the next wave of AI revolution through cutting-edge ML operations technologies. Our mission is to develop scalable and reliable ML systems that empower businesses and revolutionize industries. Join us and be part of a dynamic team committed to pushing the boundaries of what's possible with MLOps.Position Overview: As an ML Operations Engineer (MLOps), you'll play a critical role in developing and maintaining scalable and reliable machine learning pipelines and systems. Working closely with data scientists, software engineers, and DevOps specialists, you'll ensure the smooth deployment, monitoring, and optimization of machine learning models in production environments. If you're passionate about bridging the gap between data science and operations and eager to drive innovation in ML infrastructure, we want you on our team.RequirementsKey Responsibilities: ML Pipeline Development: Design, implement, and maintain end-to-end ML pipelines for model training, evaluation, deployment, and monitoring, leveraging best practices in MLOps Model Deployment: Deploy machine learning models into production environments, ensuring scalability, reliability, and performance, and automating deployment processes using CI/CD pipelines Model Monitoring: Implement monitoring and alerting systems to track model performance, data drift, and model drift, and take proactive measures to maintain model health and accuracy Infrastructure Management: Manage cloud-based infrastructure and resources for machine learning workloads, optimizing for cost, performance, and scalability Version Control: Implement version control and model versioning systems to track changes to models and ensure reproducibility and traceability Collaboration and Documentation: Collaborate with cross-functional teams to define requirements, prioritize tasks, and deliver solutions that meet business objectives, and document processes and workflows for knowledge sharing and onboarding Security and Compliance: Implement security best practices and ensure compliance with data privacy regulations in ML systems and workflowsQualifications:Bachelor's degree or higher in Computer Science, Engineering, or related fieldStrong background in machine learning operations (MLOps) or DevOps, with hands-on experience in deploying and managing machine learning models in production environmentsProficiency in programming languages such as Python, Java, or Go, and experience with ML frameworks and libraries such as TensorFlow, PyTorch, or scikit-learnExperience with cloud platforms such as AWS, Azure, or Google Cloud, and proficiency in using relevant tools and services for ML infrastructure management, such as Kubernetes, Docker, or Apache AirflowFamiliarity with CI/CD pipelines, version control systems (e.g., Git), and infrastructure as code (IaC) tools (e.g., Terraform)Strong problem-solving abilities and analytical thinking, with a keen attention to detail and a passion for tackling complex technical challengesExcellent communication and collaboration skills, with the ability to work effectively in cross-functional teams and communicate technical concepts to non-technical stakeholdersBenefitsCompetitive salary: The industry standard salary for ML Operations Engineers (MLOps) typically ranges from $150,000 to $230,000 per year, depending on experience and qualifications. Exceptional candidates may be eligible for higher compensation packagesComprehensive health, dental, and vision insurance plansFlexible work hours and remote work optionsGenerous vacation and paid time offProfessional development opportunities, including access to training programs, conferences, and workshopsState-of-the-art technology environment with access to cutting-edge ML tools and resourcesVibrant and inclusive company culture with team-building activities and social eventsOpportunities for career growth and advancement within the companyExciting projects with real-world impact across diverse industriesChance to work alongside top talent and industry experts in the field of ML operationsJoin Us: Ready to shape the future of ML operations? Apply now to join our team and be part of an exciting journey of innovation and growth!",
    "postedDate": "2 months ago",
    "link": "https://www.linkedin.com/jobs/view/ml-operations-engineer-mlops-at-unreal-staffing-inc-3895822106?position=29&pageNum=0&refId=b98zVd8fywwKP6YE3dmx8g%3D%3D&trackingId=LfEhbm67mQSrzm3a16Il0A%3D%3D&trk=public_jobs_jserp-result_search-card"
  },
  {
    "title": "Looking for Azure AI DevOps/MLOps - NYC NY (Hybrid) - Contract // Urgent Hiring",
    "companyName": "Extend Information Systems Inc.",
    "location": "New York, NY",
    "description": "Hi,I hope you are doing well!We have an opportunity for Azure AI DevOps/MLOps with one of our clients for NYC, NY (Hybrid)Please see the job details below and let me know if you would be interested in this role.If interested, please send me a copy of your resume, contact details, availability, and a good time to connect with you.Title: Azure AI DevOps/MLOpsLocation: NYC, NY (Hybrid)Terms: Contract Need Only Local CandidateJob DetailsNeed 13+ Years of Candidate.This resource will be part of our growing Infrastructure Automation Team within Public Cloud. This role will be key in working with various infrastructure teams (Security, Networking, Database, Unix) to develop, deploy and support cloud and hybrid applications. Due to the collaborative nature of the role, it will be important that this resource be senior in both AI/ML / AWS / technical skills and interpersonal skills. Candidate should have strong communication, teamwork, customer service and leadership skills to partner with broader global technology engineering, information security and line of business teams.Translate the vision of business leaders into realistic technical implementations.Select appropriate AWS and/or Azure technologies, considering deployment models and integration with existing tools.Collaborate with Enterprise Architecture, Application Development, and Business teams to engineer pilot use cases and develop production solutions.Gather inputs from multiple stakeholders to align technical implementation with existing and future requirements.Work closely with security and risk leaders to foresee and mitigate risks, ensuring ethical AI implementation and compliance.Address potential issues such as training data poisoning, AI model theft, and adversarial samples.Build tools and capabilities that assist with data ingestion, feature engineering, data management, and organization.Design, implement, and maintain distributed computing solutions for data processing and model training, ensuring the security, scalability, and reliability of machine learning infrastructure.Understand and contribute to MLOps and LLMOps, focusing on operational capabilities and infrastructure to deploy and manage machine learning models and large language models.Preferred QualificationsBachelor's Degree in any of Computer Science, Statistics, Data Science, or a related field.Certifications in AI/ML technologies and Cloud platforms, such as AWS Certified Machine Learning, Azure AI Engineer, Azure Data Scientist, or Azure Solutions Architect5 + years of experience in Data Science, Machine Learning, or AI environmentexperience in implementing cloud-based AI/ML workloads on AWS and/or Azure.experience gathering non-functional requirements, performing designed and validated application architecture frameworks, and executing functional and testing assignments.experience in Generative AI/LLMs, preferably experienced in delivering and productionizing.experience in machine learning model development, natural language processing, and data analysis; Experienced in Supervised and Unsupervised learning, feature engineering, model training, and deployment.Thanks & RegardsMonika SinghExtend Information System IncEmail: monika@extendinfosys.com44258 Mercure Circle, UNIT 102 A, Sterling VA, USA – 20166",
    "postedDate": "2 months ago",
    "link": "https://www.linkedin.com/jobs/view/looking-for-azure-ai-devops-mlops-nyc-ny-hybrid-contract-urgent-hiring-at-extend-information-systems-inc-3909185899?position=30&pageNum=0&refId=b98zVd8fywwKP6YE3dmx8g%3D%3D&trackingId=8dF%2BuckDw64dVsptqGNu0g%3D%3D&trk=public_jobs_jserp-result_search-card"
  },
  {
    "title": "N/A",
    "companyName": "N/A",
    "location": "N/A",
    "description": "N/A",
    "postedDate": "N/A",
    "link": "https://www.linkedin.com/jobs/view/ai-ml-engineers-for-mlops-llm-ops-capability-development-at-zortech-solutions-3890311657?position=31&pageNum=0&refId=b98zVd8fywwKP6YE3dmx8g%3D%3D&trackingId=vBjAoWHcxw%2FkJCcb4F45%2BQ%3D%3D&trk=public_jobs_jserp-result_search-card"
  },
  {
    "title": "N/A",
    "companyName": "N/A",
    "location": "N/A",
    "description": "N/A",
    "postedDate": "N/A",
    "link": "https://www.linkedin.com/jobs/view/ai-devops-ml-mlops-with-azure-at-cybertec-inc-3913496465?position=32&pageNum=0&refId=b98zVd8fywwKP6YE3dmx8g%3D%3D&trackingId=R4GRnEY5XWRXztVZeXqr6Q%3D%3D&trk=public_jobs_jserp-result_search-card"
  },
  {
    "title": "N/A",
    "companyName": "N/A",
    "location": "N/A",
    "description": "N/A",
    "postedDate": "N/A",
    "link": "https://www.linkedin.com/jobs/view/mlops-engineer-at-intelliswift-software-3923193151?position=33&pageNum=0&refId=b98zVd8fywwKP6YE3dmx8g%3D%3D&trackingId=Z6NBdnYqDFQHCjveu%2FVhmQ%3D%3D&trk=public_jobs_jserp-result_search-card"
  },
  {
    "title": "N/A",
    "companyName": "N/A",
    "location": "N/A",
    "description": "N/A",
    "postedDate": "N/A",
    "link": "https://www.linkedin.com/jobs/view/mlops-engineer-at-vianai-systems-inc-3934999749?position=34&pageNum=0&refId=b98zVd8fywwKP6YE3dmx8g%3D%3D&trackingId=1GbLaED6TQ9nk1wwSmDuiQ%3D%3D&trk=public_jobs_jserp-result_search-card"
  },
  {
    "title": "MLOps Developer with AWS",
    "companyName": "IT Minds LLC",
    "location": "United States",
    "description": "Job Title: MLOps Developer with AWSLocation: RemoteDuration: 1+ YearJob DescriptionKEY RESPONSIBILITIESDesign, build, and maintain cloud infrastructure on AWS using tools such as CloudFormation and Terraform, following infrastructure as code principles, with a focus on establishing and maintaining best practices for MLOps infrastructure.Manage and optimize AWS services such as AWS Sagemaker and AWS ECS.Implement security best practices and ensure compliance with industry standards.Collaborate with development teams to streamline the software development lifecycle.Monitor system performance and troubleshoot issues to ensure uptime and reliability.Design and implement cloud network architecture, including VPCs, subnets, SGs, DNS, load balancers.Implement and manage CI/CD pipelines for automated deployment and testing.RequirementsExtensive experience with AWS system and network architecture design, with specific focus on AWS Sagemaker and AWS ECS.Strong proficiency in CloudFormation and Terraform for infrastructure as code.Proficiency in at least one programming language, with preference for Ruby.Strong problem-solving skills and the ability to troubleshoot complex issues.AWS Solutions Architect certifications (optional but preferred).Experience with infrastructure migration projects is a plus.Excellent communication and collaboration skills.EDUCATIONBachelor’s degree in computer science or equivalent certifications.",
    "postedDate": "2 months ago",
    "link": "https://www.linkedin.com/jobs/view/mlops-developer-with-aws-at-it-minds-llc-3914118042?position=35&pageNum=0&refId=b98zVd8fywwKP6YE3dmx8g%3D%3D&trackingId=d2AEaOB4xmhIANgtgbIJ1A%3D%3D&trk=public_jobs_jserp-result_search-card"
  },
  {
    "title": "MLOps Engineer",
    "companyName": "Harnham",
    "location": "New York City Metropolitan Area",
    "description": "MLOps Engineer$160,000 - $200,000In- Person NYC My Client is a notable high-growth technology company at the forefront of transforming the accounting industry. Their cutting-edge AI platform is tailored specifically for accounting firms, streamlining processes end-to-end with unparalleled efficiency. As they continue to innovate, seeking a passionate individual to join a dynamic team and drive their mission forward.As an MLOps Engineer, you'll be responsible for maintaining Machine Learning system integrity and ensuring its reliability over time. Your expertise in Python and machine learning engineering will be instrumental in scaling models efficiently and accurately. With a focus on data pipelines, you'll organize, scale, and maintain multiple models that operate in tandem, ensuring that data is always precise.THE ROLEJoin a dynamic team leading the charge in revolutionizing the energy industry, harnessing the potential of cutting-edge large models to redefine our field.Collaborate with like-minded individuals driven by a passion for driving transformative change and leaving a sustainable legacy.Pioneer is at the forefront of agent-based workflows, uncovering novel paradigms and tackling intricate challenges head-on.YOUR SKILLS AND EXPERIENCERequirements:Demonstrated proficiency in architecting, planning, and scaling solutions through hands-on project experience from inception to completion.Proven commercial experience in machine learning, with a specialization in MLOps and the deployment of production-grade solutions.Exceptional communication skills, enabling you to effectively convey intricate technical concepts in machine learning to non-technical stakeholders.A track record of technical leadership and mentorship in the realm of Machine Learning, guiding teams toward delivering impactful and high-quality solutions.THE BENEFITSA competitive base salary of $160,000-$200,000 will be offered (dependent on experience) + Equity + BenefitsHOW TO APPLYPlease register your interest by sending your Resume to Cassie Wandell via the Apply link on this pageKEYWORDSMLOps | Machine Learning | AI | TensorFlow | Deep Learning | AWS | PyTorch | Edge Computing | Agile | Python | Hadoop | Java | C | API | SIRI | Big Data | Statistics | Bayesian",
    "postedDate": "1 week ago",
    "link": "https://www.linkedin.com/jobs/view/mlops-engineer-at-harnham-3963040683?position=36&pageNum=0&refId=b98zVd8fywwKP6YE3dmx8g%3D%3D&trackingId=xJV4ykCJX%2BCYEVrVAEVGvA%3D%3D&trk=public_jobs_jserp-result_search-card"
  },
  {
    "title": "Sr MLOPS Engineer",
    "companyName": "CloudSpace LLC",
    "location": "North Carolina, United States",
    "description": "Required QualificationsAbility to design and implement cloud solutions and ability to build MLOps pipelines on cloud solutions (AWS, MS Azure or Google Cloud Platform)Experience with MLOps Frameworks like Kuberflow, MLFlow, DataRobot, Airflow etc., experience with Docker and Kubernetes, OpenShiftProgramming languages like Python, Go, Ruby or Bash, good understanding of Linux, knowledge of frameworks such as scikit-learn, Keras, PyTorch, Tensorflow, etc.Ability to understand tools used by data scientist and experience with software development and test automationFluent in English, good communication skills and ability to work in a teamDesired QualificationsBachelor s degree in Computer Science or Software EngineeringExperience in using AWS, MS Azure or Google Cloud Platform services.Good to have any associate Cloud Certification",
    "postedDate": "1 week ago",
    "link": "https://www.linkedin.com/jobs/view/sr-mlops-engineer-at-cloudspace-llc-3956178964?position=37&pageNum=0&refId=b98zVd8fywwKP6YE3dmx8g%3D%3D&trackingId=M3p05qIOZk0gARvycbJeFQ%3D%3D&trk=public_jobs_jserp-result_search-card"
  },
  {
    "title": "N/A",
    "companyName": "N/A",
    "location": "N/A",
    "description": "N/A",
    "postedDate": "N/A",
    "link": "https://www.linkedin.com/jobs/view/mlops-engineer-at-eleccion-llc-3928904716?position=38&pageNum=0&refId=b98zVd8fywwKP6YE3dmx8g%3D%3D&trackingId=7hgqQyeZWtlx5ZyQ%2BnJD1A%3D%3D&trk=public_jobs_jserp-result_search-card"
  },
  {
    "title": "N/A",
    "companyName": "N/A",
    "location": "N/A",
    "description": "N/A",
    "postedDate": "N/A",
    "link": "https://www.linkedin.com/jobs/view/mlops-engineer-at-trustly-3954748811?position=39&pageNum=0&refId=b98zVd8fywwKP6YE3dmx8g%3D%3D&trackingId=1RRAIethiuHTTAd2XHlf%2BQ%3D%3D&trk=public_jobs_jserp-result_search-card"
  },
  {
    "title": "N/A",
    "companyName": "N/A",
    "location": "N/A",
    "description": "N/A",
    "postedDate": "N/A",
    "link": "https://www.linkedin.com/jobs/view/data-scientist-ml-and-ai-at-extend-information-systems-inc-3908686891?position=40&pageNum=0&refId=b98zVd8fywwKP6YE3dmx8g%3D%3D&trackingId=sUWJz4xpTqCdFbBSpbXf5A%3D%3D&trk=public_jobs_jserp-result_search-card"
  },
  {
    "title": "N/A",
    "companyName": "N/A",
    "location": "N/A",
    "description": "N/A",
    "postedDate": "N/A",
    "link": "https://www.linkedin.com/jobs/view/mlops-engineer-at-harnham-3953805946?position=41&pageNum=0&refId=b98zVd8fywwKP6YE3dmx8g%3D%3D&trackingId=LQ6CiFGUVu0%2FVWuYnKczAg%3D%3D&trk=public_jobs_jserp-result_search-card"
  },
  {
    "title": "Engineering Manager - MLOps",
    "companyName": "Cognitiv",
    "location": "Bellevue, WA",
    "description": "Cognitiv leverages deep learning artificial intelligence to build custom algorithms that more accurately and efficiently predict consumer purchase behavior. Each marketer has a unique set of goals, which is why Cognitiv created NeuralMind, a deep learning platform capable of automatically building custom algorithms that simultaneously consider the user, the context, the message, and the campaign objectives. We combine deterministic data and advanced processing techniques to continuously train these algorithms as they optimize our clients’ key performance indicators (KPIs), predicting consumer behavior in order to autonomously drive full-funnel marketing performance at scale.We are looking for an Engineering Manager to take full responsibility for Cognitiv projects. Applicant will oversee the project vision, planning and timelines, and the development and management of engineers. This position will play a key role in the development of our ML Ops platform. Your work will directly enable Cognitiv's team of data scientists to build the next generation of deep learning models that allow our campaigns to perform at scale.This position will be located in Bellevue, WA with a hybrid work schedule of 3 days in office (Mon/Tue/Wed) and 2 days remote (Thursday/Friday). The schedule is the same across all business units/office locations.ResponsibilitiesManage priorities and tasks for a team of developersDevelop the skills of junior developersGuide technical project objectives and deadlinesImplement and monitor technical strategy performance metricsDirect the work of engineers to ensure the best practices around software developmentReview engineers code and provide meaningful feedbackSupport, coach and develop high performing engineers through regular 1:1s, continuous feedback and relationships with othersConstantly search for improvements in process, improve software delivery and operational processesCollaborate closely with cross-functional peers to set the direction of your team and develop your product roadmapCoordinate internal teams to ensure project timelines and budgets are metRequirements4 years of experience in any programming languageHas led technical teams and projects previouslyExpertise with the Software Development Life Cycle, software-based tools and workflowsStrong written and verbal communication, organizational, and negotiation skillsPossess strong analytical skills; ability to inspect, analyze, and influence using dataCommitment to quality in every assignment, large or smallPreferred QualificationsExperience with Terraform (infrastructure as code)Experience with ML Ops technologies (Orchestration, Model Management, Feature Stores, etc)Experience collaborating with science teamsSalary$160,000-$210,000 Base Salary + EquityActual compensation is based on multiple factors that are unique to each candidate, including and not limited to job-related knowledge, level of relevant experience, education and skills. Base salary is just one component of your total rewards package at Cognitiv. Employees are eligible for equity and various benefits.Here are some of the many benefits that our employees receive: Medical, Dental and Vision coverage, including some plans that are 100% employer paid 12 weeks paid parental leave Unlimited PTO Hybrid work model Lunch reimbursement Fitness reimbursement Cell phone reimbursement 401(k) plan Employee Assistance Program Pre-tax commuter benefitsCognitiv has been revolutionizing the programmatic/ad tech space for the last 8 years as the only programmatic buying platform to leverage Deep Learning in real-time. We use Deep Learning (the most sophisticated machine learning) to build custom algorithms for digital marketers to help grow their customer base. We have seen explosive growth and are looking for talented people who have a passion to learn about AI and are looking to affect change in a rapidly growing organization . You will be a valued member in a company with great culture and generous benefits.Cognitiv is an equal opportunity employer. We do not discriminate on the basis of race, color, religion, marital status, age, national origin, ancestry, physical or mental disability, medical condition, pregnancy, genetic information, gender, sexual orientation, gender identity or expression, veteran status, or any other status protected under federal, state, or local law.",
    "postedDate": "1 week ago",
    "link": "https://www.linkedin.com/jobs/view/engineering-manager-mlops-at-cognitiv-3960263226?position=42&pageNum=0&refId=b98zVd8fywwKP6YE3dmx8g%3D%3D&trackingId=IJ4vNMX4of1riSEWojm07w%3D%3D&trk=public_jobs_jserp-result_search-card"
  },
  {
    "title": "ML Ops Engineer",
    "companyName": "VIR Consultant LLC",
    "location": "Queens County, NY",
    "description": "Job DescriptionIndustry: InsuranceJob Category: Information Technology - Computer Network SecurityTransformation happens here. Come, be a part of our exciting journey!Are you the one we are looking for?Inviting applications for the role of ML Ops Engineer.ML Ops EngineerPennsylvania, NYC, Toronto - USANeed to Travel to any of these locations 2-3 weeks initially to understand the project after 3-4 days in a month.SummaryWe are seeking a highly skilled and experienced MLOps Engineer to join our team in USA. You will play a crucial role in building and maintaining the infrastructure and pipelines for our cutting-edge Generative AI applications, working closely with the Generative AI Full Stack Architect. Your expertise in automating and streamlining the ML lifecycle will be instrumental in ensuring the efficiency, scalability, and reliability of our Generative AI models in production.ResponsibilitiesDesign, develop, and implement ML Ops pipelines for generative AI models, encompassing data ingestion, pre-processing, training, deployment, and monitoring.Automate ML tasks across the model lifecycle, leveraging tools like Git Ops, CI/CD pipelines, and containerization technologies (e.g., Docker, Kubernetes).Develop and maintain robust monitoring and alerting systems for generative AI models in production, ensuring proactive identification and resolution of issues.Collaborate with the Generative AI Full Stack Architect and other engineers to optimize model performance and resource utilization.Manage and maintain cloud infrastructure (e.g., AWS, GCP, Azure) for ML workloads, ensuring cost-efficiency and scalability.Stay up to date on the latest advancements in ML Ops and incorporate them into our platform and processes.Communicate effectively with technical and non-technical stakeholders about the health and performance of generative AI models.QualificationsBachelor's degree in Computer Science, Data Science, Engineering, or a related field, or equivalent experience.8+ years of experience in ML Ops or related areas, such as DevOps, data engineering, or ML infrastructure.Proven experience in automating ML pipelines with tools like ML flow, Kubeflow, Airflow, etc.Expertise in cloud platforms (e.g., AWS, Azure) for ML workloads.Strong understanding of CI/CD principles and containerization technologies like Docker and Kubernetes.Familiarity with monitoring and alerting tools for ML systems (e.g., Prometheus, Grafana).Excellent communication, collaboration, and problem-solving skills.Ability to work independently and as part of a team.Passion for Generative AI and its potential to revolutionize various industries.Senior individual contributor with significant expertise and leadership experience.Manages complex projects and initiatives with independent decision-making authority.Provides technical guidance and mentoring to junior team members.Has a proven track record of success in delivering impactful results.",
    "postedDate": "5 months ago",
    "link": "https://www.linkedin.com/jobs/view/ml-ops-engineer-at-vir-consultant-llc-3808555243?position=43&pageNum=0&refId=b98zVd8fywwKP6YE3dmx8g%3D%3D&trackingId=0cwAwcALXecS3NYUPVKMNg%3D%3D&trk=public_jobs_jserp-result_search-card"
  },
  {
    "title": "MLOPS Engineer",
    "companyName": "Accord Technologies Inc",
    "location": "Charlotte, NC",
    "description": "Title: Machine learning Engineer for production (MLOps Engineer)Locations: Charlotte, NC or Islin, NJ orDallas, TX (Hybrid, 3 days onsite needed) any location is fine.Number of positions:8Visa: Any visa independent candidatesRate: on W2Job Description10+ years of IT experience in which at least 6+ years of relevant experience primarily in MLOps, Cloud, Dockerization & Containerization.Expereince in AI/ML operations and automation of various proceses as part of the MDLCResponsible for Design and Estimation of MLOps work.Responsible for creating/updating JIRA stories related to MLOps work.Manage Code Repositories - Manage, Document, Control and Innovate Development and Release procedure. - Configure automated deployment on multiple environmentWorking on performance tuning and optimization, bottleneck problems analysis.Extensive experience with infrastructure provisioning and configuring public and hybrid clouds.Dockerization of Machine Learning scripts and deployment in various Cloud Platform.Ability to automatically create and deploy Machine Learning notebooks. Also, ability to establish connection with Big Data infrastructure from the Machine Learning notebooks.Experience with CI/CD pipelines and related tools such as Jenkins or CircleCI and Google Cloud Build.Setup of Monitoring and Alerts for Production workloads in Various Cloud Platform.Experience in automating multiple systems using Bash and languages such as Python and Go.Recommend and implement automated solutions that will improve the performance and reliability of the system.Strong understanding and experience operating in an agile development environment.Strong communication skills across the board, with a passion for finding and sharing best practices and driving greater discipline.Excellent verbal and written communication skills in English.",
    "postedDate": "2 months ago",
    "link": "https://www.linkedin.com/jobs/view/mlops-engineer-at-accord-technologies-inc-3888465827?position=44&pageNum=0&refId=b98zVd8fywwKP6YE3dmx8g%3D%3D&trackingId=a%2BsUqYEILzbLX7106TYC%2BQ%3D%3D&trk=public_jobs_jserp-result_search-card"
  },
  {
    "title": "N/A",
    "companyName": "N/A",
    "location": "N/A",
    "description": "N/A",
    "postedDate": "N/A",
    "link": "https://www.linkedin.com/jobs/view/mlops-ai-engineer-at-net2source-inc-3860312646?position=45&pageNum=0&refId=b98zVd8fywwKP6YE3dmx8g%3D%3D&trackingId=wXiNqLpU%2FzqJNQV1cAOi4Q%3D%3D&trk=public_jobs_jserp-result_search-card"
  },
  {
    "title": "N/A",
    "companyName": "N/A",
    "location": "N/A",
    "description": "N/A",
    "postedDate": "N/A",
    "link": "https://www.linkedin.com/jobs/view/mlops-engineer-at-dematic-3828249118?position=46&pageNum=0&refId=b98zVd8fywwKP6YE3dmx8g%3D%3D&trackingId=XUuk5EdKbU5IvdzVI%2FG8lA%3D%3D&trk=public_jobs_jserp-result_search-card"
  },
  {
    "title": "N/A",
    "companyName": "N/A",
    "location": "N/A",
    "description": "N/A",
    "postedDate": "N/A",
    "link": "https://www.linkedin.com/jobs/view/sr-mlops-engineer-with-azure-and-llm-at-warrior-tech-solutions-3865770491?position=47&pageNum=0&refId=b98zVd8fywwKP6YE3dmx8g%3D%3D&trackingId=QrqBk4TFVfanDbiWuYSDww%3D%3D&trk=public_jobs_jserp-result_search-card"
  },
  {
    "title": "N/A",
    "companyName": "N/A",
    "location": "N/A",
    "description": "N/A",
    "postedDate": "N/A",
    "link": "https://www.linkedin.com/jobs/view/mlops-engineer-at-zencon-group-3797047264?position=48&pageNum=0&refId=b98zVd8fywwKP6YE3dmx8g%3D%3D&trackingId=ZmWP3BbVbS2rZnhw9uE7xA%3D%3D&trk=public_jobs_jserp-result_search-card"
  },
  {
    "title": "MLOps Engineer",
    "companyName": "Stanford Health Care",
    "location": "Sacramento, CA",
    "description": "1.0 FTE Full time Day - 08 Hour R2333357 Remote USA 84868 TDS DATA SCIENCE INNOVATION Technology & Digital SolutionsIf you're ready to be part of our legacy of hope and innovation, we encourage you to take the first step and explore our current job openings. Your best is waiting to be discovered.Day - 08 Hour (United States of America)We are seeking a versatile DevOps Engineer with a strong foundation in full stack development to join our dynamic team. In addition to your expert-level DevOps skills, we are excited to see candidates who have hands-on experience in full stack development. As a DevOps Engineer at Stanford Healthcare, you'll play a crucial role in bridging the gap between development and operations, ensuring seamless integration, deployment, and automation of our systems. Your proficiency in both areas will empower you to architect solutions that not only optimize our infrastructure but also enhance the end-to-end development lifecycle. If you possess a deep understanding of coding, architecture, and deployment processes, coupled with your proven DevOps expertise, we encourage you to bring your unique perspective and skill set to our team. Your ability to collaborate, adapt, and innovate will contribute to the growth and success of both our DevOps practices and our broader development initiatives.This is a Stanford Health Care job.A Brief OverviewThe MLOPs Engineer will play an integral role incorporating Artificial Intelligence (AI) within Stanford Health Care. The solutions will impact patient care, medical research, and operational services. This group is tasked to innovate, build, deploy and monitor production grade AI, machine learning (ML) and predictive algorithms into healthcare. The role will partner closely with lead researchers within the AI field and leaders across various clinical specialties and operations.This role will report to the Infrastructure group and have a dotted line relationship to the Data Science team. The role will be responsible for maintaining cloud-based infrastructure as code repositories, maintaining infrastructure, deployment pipelines and designing the security landscape for the team and objects. The role will set the standards for the full SDLC of projects for the Data Science team.LocationsStanford Health CareWhat You Will DoDesign, build and maintain scalable and robust infrastructure for AI/ML systems, including cloud-based environments, containerization and orchestration platforms.Develop and implement CI/CD pipelines to automate the deployment, testing and monitoring of AI/ML models and applications.Collaborate with data scientists, data engineers and software engineers to optimize model training, deployment and inference pipelines.Monitor and troubleshoot AI/ML systems to ensure high availability, performance and reliability.Maintain and monitor model training and inference pipelines across multi-cloud tenants especially around Large Language Models (LLMs).Maintain Kubernetes pods, container registry and virtual machine image library and model registryMonitor infrastructure utilization and costs pertaining to model training, inference and GPU utilizationImplement best practices for security, data privacy and compliance in AI/ML workflows and infrastructure.Evaluate and integrate new tools, technologies and frameworks to improve the efficiency and effectiveness of our MLOps processes.Mentor and provide technical guidance to junior members of the organization.Stay up-to-date with the latest advancements and trends in MLOps, DevOps and cloud technologies and share them with the team.Education QualificationsBachelor’s or higher degree in Computer Science, Engineering or a related fieldExperience QualificationsThree (3) or more years of directly related experienceRequired Knowledge, Skills And AbilitiesProven experience as an MLOps Engineer.Strong knowledge of cloud platforms such as AWS, Azure or Google Cloud and experience with infrastructure-as-code tools like Terraform or CloudFormation.Proficiency in containerization technologies such as Docker and container orchestration platforms like Kubernetes.Experience with CI/CD tools such as GitLab CI/CD, Github Actions or CiricleCI.Solid programming skills in languages such as Python, Rust or Go and experience in scripting and automation.Familiarity with machine learning frameworks and libraries such as PyTorch, Tensorflow and scikit-learn.Deep understanding of DevOps principles, agile methodologies and software development lifecycle.Strong problem-solving and trouble shooting skills, with the ability to analyze and resolve complex technical issues.Excellent communication and collaboration skills with the ability to work effectively in cross-functional teams.Physical Demands and Work ConditionsBlood Borne PathogensCategory III - Tasks that involve NO exposure to blood, body fluids or tissues, and Category I tasks that are not a condition of employmentThese Principles Apply To ALL EmployeesSHC Commitment to Providing an Exceptional Patient & Family ExperienceStanford Health Care sets a high standard for delivering value and an exceptional experience for our patients and families. Candidates for employment and existing employees must adopt and execute C-I-CARE standards for all of patients, families and towards each other. C-I-CARE is the foundation of Stanford’s patient-experience and represents a framework for patient-centered interactions. Simply put, we do what it takes to enable and empower patients and families to focus on health, healing and recovery.You will do this by executing against our three experience pillars, from the patient and family’s perspective: Know Me: Anticipate my needs and status to deliver effective careShow Me the Way: Guide and prompt my actions to arrive at better outcomes and better healthCoordinate for Me: Own the complexity of my care through coordinationEqual Opportunity Employer Stanford Health Care (SHC) strongly values diversity and is committed to equal opportunity and non-discrimination in all of its policies and practices, including the area of employment. Accordingly, SHC does not discriminate against any person on the basis of race, color, sex, sexual orientation or gender identity and/or expression, religion, age, national or ethnic origin, political beliefs, marital status, medical condition, genetic information, veteran status, or disability, or the perception of any of the above. People of all genders, members of all racial and ethnic groups, people with disabilities, and veterans are encouraged to apply. Qualified applicants with criminal convictions will be considered after an individualized assessment of the conviction and the job requirements.Base Pay Scale: Generally starting at $74.66 - $98.94 per hourThe salary of the finalist selected for this role will be set based on a variety of factors, including but not limited to, internal equity, experience, education, specialty and training. This pay scale is not a promise of a particular wage.",
    "postedDate": "9 months ago",
    "link": "https://www.linkedin.com/jobs/view/mlops-engineer-at-stanford-health-care-3727279439?position=49&pageNum=0&refId=b98zVd8fywwKP6YE3dmx8g%3D%3D&trackingId=UmSaJj1caQ1P%2BJECPMk6Zw%3D%3D&trk=public_jobs_jserp-result_search-card"
  },
  {
    "title": "AWS/ML Ops Specialist",
    "companyName": "Steneral Consulting",
    "location": "Falls Church, VA",
    "description": "1 day onsite/week, must be local and under 60 minsNeed valid LinkedInNeed 2 references with official contact detailsRequirements 5+ years of hands-on technical experience within AWS analytics utilizing SageMaker for Machine LearningIncluding experience with AWS SageMaker Studio to build, train, and deploy ML models into production Extensive data science and machine learning engineering experience including establishing model governance frameworks Hands-on experience programming in Python or R Healthcare industry specific experience in a consultant type role – exposure to multiple projects and clients B.S. Degree Excellent communication skills with ability to be both solution oriented (customer facing, gathering requirements) as well as hands-on with tech/development team Preferred SkillsGovernment/Federal agency experience AWS Big Data Certifications ResponsibilitiesBuild and configure end-to-end MLOps pipeline on AWS cloud for model management, model deployment & service and model governance using AWS SageMaker. Use Amazon SageMaker Studio for development and tracking.Implement CI/CD pipelines using GITLAB to automate model deployment and updates, enabling rapid iterations and reducing time-to-market.Create Framework for deploying Client models to production environments using SageMaker endpoints and set up monitoring to track model performance and drift over time.Set up and run SageMaker Clarify bias analysis through Amazon Sagemaker Experiments to check the model for potential biases.Setup SageMaker Model Monitor to allow clients to select data from a menu of options such as prediction output, and capture metadata such as timestamp, model name, and end point so that clients can analyze model predictions based on the metadata.Maintain logs for reproducibility, validation, conformity, and auditability.Add Cohort model explainability used in the deployment phase, specifically in the model validation step before deployment.Implement static deployment strategies (using traffic routing patterns) to deploy Client model(s) - Blue/Green, A/B",
    "postedDate": "1 month ago",
    "link": "https://www.linkedin.com/jobs/view/aws-ml-ops-specialist-at-steneral-consulting-3918875212?position=50&pageNum=0&refId=b98zVd8fywwKP6YE3dmx8g%3D%3D&trackingId=YlSVa9nqfCGx0Y9MKUE5wA%3D%3D&trk=public_jobs_jserp-result_search-card"
  },
  {
    "title": "Senior ML Operations Engineer (MLOps)",
    "companyName": "Unreal Staffing, Inc",
    "location": "San Francisco, CA",
    "description": "Company Overview: Welcome to the forefront of machine learning operations (MLOps)! Our company is dedicated to harnessing the power of machine learning to drive innovation and transform industries. We're committed to developing cutting-edge ML solutions that deliver real-world impact and value to our customers. Join us and be part of a dynamic team shaping the future of MLOps.Position Overview: As a Senior ML Operations Engineer, you'll play a critical role in building and maintaining the infrastructure and processes that enable the deployment, monitoring, and management of machine learning models at scale. You'll work closely with data scientists, software engineers, and DevOps teams to streamline the machine learning lifecycle and ensure reliable and efficient model operations. If you're a seasoned engineer with a passion for machine learning and a track record of designing and implementing MLOps solutions, we want you on our team.RequirementsKey Responsibilities: Infrastructure Design: Design and implement scalable and reliable infrastructure for deploying and serving machine learning models, leveraging cloud platforms and containerization technologies Model Deployment: Develop automated pipelines for deploying machine learning models into production environments, ensuring consistency, reliability, and reproducibility Monitoring and Alerting: Implement monitoring and alerting systems to track model performance, data drift, and other metrics, enabling proactive detection and mitigation of issues Model Versioning and Management: Establish version control and management processes for machine learning models, enabling easy tracking, rollback, and experimentation Continuous Integration/Continuous Deployment (CI/CD): Implement CI/CD pipelines for automating model training, testing, and deployment, reducing time to market and improving agility Scalability and Efficiency: Optimize the performance and scalability of machine learning infrastructure, leveraging techniques such as distributed computing, parallelization, and resource management Security and Compliance: Ensure machine learning systems comply with security and privacy standards, implementing access controls, encryption, and other security measures as needed Documentation and Best Practices: Document MLOps processes, best practices, and standards, providing guidance and training to data scientists and engineers Collaboration: Collaborate with cross-functional teams, including data scientists, software engineers, and DevOps teams, to streamline the machine learning lifecycle and drive continuous improvement Research and Innovation: Stay informed about the latest advancements in MLOps tools and technologies, exploring innovative approaches and techniques to enhance machine learning operationsQualifications:Bachelor's degree or higher in Computer Science, Engineering, Mathematics, or related field5+ years of experience in software engineering, DevOps, or related roles, with a focus on building and maintaining infrastructure for machine learning operationsStrong understanding of machine learning concepts and techniques, with experience working with data science teams and machine learning modelsProficiency in programming languages such as Python, Java, or Scala, and experience with cloud platforms such as AWS, Azure, or Google Cloud PlatformExperience with containerization technologies such as Docker and orchestration tools such as KubernetesFamiliarity with machine learning frameworks and libraries such as TensorFlow, PyTorch, scikit-learn, or MLflowExperience with CI/CD pipelines, version control systems, and automation tools such as Jenkins, GitLab, or CircleCIStrong problem-solving skills and analytical thinking, with the ability to troubleshoot complex issues and optimize system performanceExcellent communication and collaboration skills, with the ability to work effectively in cross-functional teams and communicate technical concepts to non-technical stakeholdersBenefitsCompetitive salary: The industry standard salary for Senior ML Operations Engineers typically ranges from $170,000 to $250,000 per year, depending on experience and qualificationsComprehensive health, dental, and vision insurance plansFlexible work hours and remote work optionsGenerous vacation and paid time offProfessional development opportunities, including access to training programs, conferences, and workshopsState-of-the-art technology environment with access to cutting-edge tools and resourcesVibrant and inclusive company culture with opportunities for growth and advancementExciting projects with real-world impact at the forefront of MLOps innovationJoin Us: Ready to shape the future of machine learning operations? Apply now to join our team and drive innovation in MLOps!",
    "postedDate": "2 months ago",
    "link": "https://www.linkedin.com/jobs/view/senior-ml-operations-engineer-mlops-at-unreal-staffing-inc-3897981425?position=51&pageNum=0&refId=b98zVd8fywwKP6YE3dmx8g%3D%3D&trackingId=4fWdOaSqoqCRF8%2BrGrQeug%3D%3D&trk=public_jobs_jserp-result_search-card"
  },
  {
    "title": "N/A",
    "companyName": "N/A",
    "location": "N/A",
    "description": "N/A",
    "postedDate": "N/A",
    "link": "https://www.linkedin.com/jobs/view/senior-ml-operations-engineer-mlops-at-unreal-staffing-inc-3897983124?position=52&pageNum=0&refId=b98zVd8fywwKP6YE3dmx8g%3D%3D&trackingId=UPmV8EZAkK7r6bPDYrZnzw%3D%3D&trk=public_jobs_jserp-result_search-card"
  },
  {
    "title": "N/A",
    "companyName": "N/A",
    "location": "N/A",
    "description": "N/A",
    "postedDate": "N/A",
    "link": "https://www.linkedin.com/jobs/view/engineering-manager-mlops-at-cognitiv-3961446224?position=53&pageNum=0&refId=b98zVd8fywwKP6YE3dmx8g%3D%3D&trackingId=K9xF4pAkx8JqTSO5D80ZEQ%3D%3D&trk=public_jobs_jserp-result_search-card"
  },
  {
    "title": "N/A",
    "companyName": "N/A",
    "location": "N/A",
    "description": "N/A",
    "postedDate": "N/A",
    "link": "https://www.linkedin.com/jobs/view/mlops-engineer-at-harnham-3950533675?position=54&pageNum=0&refId=b98zVd8fywwKP6YE3dmx8g%3D%3D&trackingId=DSMGp8bfWNR0v34x0xQ4bg%3D%3D&trk=public_jobs_jserp-result_search-card"
  },
  {
    "title": "N/A",
    "companyName": "N/A",
    "location": "N/A",
    "description": "N/A",
    "postedDate": "N/A",
    "link": "https://www.linkedin.com/jobs/view/machine-learning-operations-engineer-mlops-at-buzz-solutions-3965099289?position=55&pageNum=0&refId=b98zVd8fywwKP6YE3dmx8g%3D%3D&trackingId=zAaWXdDfxB7buGr7982dvQ%3D%3D&trk=public_jobs_jserp-result_search-card"
  },
  {
    "title": "AWS/ML Ops Specialist",
    "companyName": "Steneral Consulting",
    "location": "Falls Church, VA",
    "description": "1 day onsite/week, must be local and under 60 minsNeed valid LinkedInNeed 2 references with official contact detailsRequirements 5+ years of hands-on technical experience within AWS analytics utilizing SageMaker for Machine LearningIncluding experience with AWS SageMaker Studio to build, train, and deploy ML models into production Extensive data science and machine learning engineering experience including establishing model governance frameworks Hands-on experience programming in Python or R Healthcare industry specific experience in a consultant type role – exposure to multiple projects and clients B.S. Degree Excellent communication skills with ability to be both solution oriented (customer facing, gathering requirements) as well as hands-on with tech/development team Preferred SkillsGovernment/Federal agency experience AWS Big Data Certifications ResponsibilitiesBuild and configure end-to-end MLOps pipeline on AWS cloud for model management, model deployment & service and model governance using AWS SageMaker. Use Amazon SageMaker Studio for development and tracking.Implement CI/CD pipelines using GITLAB to automate model deployment and updates, enabling rapid iterations and reducing time-to-market.Create Framework for deploying Client models to production environments using SageMaker endpoints and set up monitoring to track model performance and drift over time.Set up and run SageMaker Clarify bias analysis through Amazon Sagemaker Experiments to check the model for potential biases.Setup SageMaker Model Monitor to allow clients to select data from a menu of options such as prediction output, and capture metadata such as timestamp, model name, and end point so that clients can analyze model predictions based on the metadata.Maintain logs for reproducibility, validation, conformity, and auditability.Add Cohort model explainability used in the deployment phase, specifically in the model validation step before deployment.Implement static deployment strategies (using traffic routing patterns) to deploy Client model(s) - Blue/Green, A/B",
    "postedDate": "1 month ago",
    "link": "https://www.linkedin.com/jobs/view/aws-ml-ops-specialist-at-steneral-consulting-3919672343?position=56&pageNum=0&refId=b98zVd8fywwKP6YE3dmx8g%3D%3D&trackingId=FuBq8NlBFqiml5jhkaxgWQ%3D%3D&trk=public_jobs_jserp-result_search-card"
  },
  {
    "title": "Senior MLOps Engineer",
    "companyName": "DeepRec.ai",
    "location": "San Francisco, CA",
    "description": "Job Title: MLOps Engineer - Visual Generative AIHybrid: San FranciscoJoin a pioneering visual Generative AI company at the forefront of innovation. We specialize in leveraging cutting-edge technologies to create stunning visual content, pushing the boundaries of creativity and imagination. We're seeking a talented MLOps Engineer to join our dynamic team and drive optimization, cost reduction, throughput enhancement, and rapid delivery of our groundbreaking projects.About the Role: As an MLOps Engineer, you'll play a critical role in optimizing orchestration processes, reducing costs, upgrading throughput, and ensuring fast and efficient project delivery. You'll work closely with our engineering and data science teams to streamline our machine learning operations pipeline and implement best practices for managing and deploying our visual Generative AI models.Responsibilities:Optimize orchestration processes to ensure efficient deployment and management of AI models.Implement cost-saving strategies to minimize infrastructure expenses while maximizing performance.Upgrade throughput to enhance the scalability and responsiveness of our AI systems.Collaborate with cross-functional teams to identify bottlenecks and implement solutions to improve workflow efficiency.Ship new features and updates rapidly, maintaining a high level of quality and reliability.Requirements:Extensive experience as an MLOps Engineer or similar role, with a proven track record of optimizing machine learning pipelines and infrastructure.Strong background in working with video data and processing pipelines.Proficiency in cloud computing platforms (e.g., AWS, Azure, GCP) and containerization technologies (e.g., Docker, Kubernetes).Experience with orchestration tools and frameworks such as Airflow, Kubeflow, or MLflow.Excellent problem-solving skills and the ability to troubleshoot complex issues in a fast-paced environment.Strong communication and collaboration skills, with the ability to work effectively in cross-functional teams.Why Join Us:Be part of a visionary team driving innovation in visual Generative AI.Work on cutting-edge projects that push the boundaries of creativity and imagination.Enjoy a dynamic and collaborative work environment where your ideas are valued and encouraged.Take on exciting challenges and make a meaningful impact on the future of AI and creative technology.Please apply for more details",
    "postedDate": "1 month ago",
    "link": "https://www.linkedin.com/jobs/view/senior-mlops-engineer-at-deeprec-ai-3911883376?position=57&pageNum=0&refId=b98zVd8fywwKP6YE3dmx8g%3D%3D&trackingId=%2BM%2F3jeKK5XYKlKm%2BE1qfLQ%3D%3D&trk=public_jobs_jserp-result_search-card"
  },
  {
    "title": "Lead ML Operations Engineer (MLOps)",
    "companyName": "Unreal Staffing, Inc",
    "location": "San Francisco, CA",
    "description": "Company Overview: Welcome to the forefront of machine learning operations (MLOps)! Our company is dedicated to leveraging the power of machine learning to drive innovation and transform industries. We're committed to developing cutting-edge ML solutions that deliver real-world impact and value to our customers. Join us and lead our team in shaping the future of MLOps.Position Overview: As the Lead ML Operations Engineer, you'll be responsible for leading our MLOps efforts and driving the design, implementation, and optimization of infrastructure and processes for deploying, monitoring, and managing machine learning models at scale. You'll lead a team of talented engineers and collaborate closely with data scientists, software engineers, and DevOps teams to streamline the machine learning lifecycle and ensure reliable and efficient model operations. If you're a seasoned engineer with a passion for machine learning and a track record of designing and implementing MLOps solutions, we want you on our team.RequirementsKey Responsibilities: Technical Leadership: Lead and mentor a team of ML Operations Engineers, providing guidance, direction, and support in driving MLOps innovation and execution Infrastructure Design: Design and implement scalable and reliable infrastructure for deploying and serving machine learning models, leveraging cloud platforms and containerization technologies Model Deployment: Develop automated pipelines for deploying machine learning models into production environments, ensuring consistency, reliability, and reproducibility Monitoring and Alerting: Implement monitoring and alerting systems to track model performance, data drift, and other metrics, enabling proactive detection and mitigation of issues Model Versioning and Management: Establish version control and management processes for machine learning models, enabling easy tracking, rollback, and experimentation Continuous Integration/Continuous Deployment (CI/CD): Implement CI/CD pipelines for automating model training, testing, and deployment, reducing time to market and improving agility Scalability and Efficiency: Optimize the performance and scalability of machine learning infrastructure, leveraging techniques such as distributed computing, parallelization, and resource management Security and Compliance: Ensure machine learning systems comply with security and privacy standards, implementing access controls, encryption, and other security measures as needed Documentation and Best Practices: Document MLOps processes, best practices, and standards, providing guidance and training to data scientists and engineers Collaboration: Collaborate with cross-functional teams, including data scientists, software engineers, and DevOps teams, to streamline the machine learning lifecycle and drive continuous improvement Research and Innovation: Stay informed about the latest advancements in MLOps tools and technologies, exploring innovative approaches and techniques to enhance machine learning operationsQualifications:Bachelor's degree or higher in Computer Science, Engineering, Mathematics, or related field7+ years of experience in software engineering, DevOps, or related roles, with a focus on building and maintaining infrastructure for machine learning operationsLeadership experience, with a demonstrated ability to lead and mentor a team of engineersStrong understanding of machine learning concepts and techniques, with experience working with data science teams and machine learning modelsProficiency in programming languages such as Python, Java, or Scala, and experience with cloud platforms such as AWS, Azure, or Google Cloud PlatformExperience with containerization technologies such as Docker and orchestration tools such as KubernetesFamiliarity with machine learning frameworks and libraries such as TensorFlow, PyTorch, scikit-learn, or MLflowExperience with CI/CD pipelines, version control systems, and automation tools such as Jenkins, GitLab, or CircleCIStrong problem-solving skills and analytical thinking, with the ability to troubleshoot complex issues and optimize system performanceExcellent communication and collaboration skills, with the ability to work effectively in cross-functional teams and communicate technical concepts to non-technical stakeholdersBenefitsCompetitive salary: The industry standard salary for Lead ML Operations Engineers typically ranges from $150,000 to $250,000 per year, depending on experience and qualificationsComprehensive health, dental, and vision insurance plansFlexible work hours and remote work optionsGenerous vacation and paid time offProfessional development opportunities, including access to training programs, conferences, and workshopsState-of-the-art technology environment with access to cutting-edge tools and resourcesVibrant and inclusive company culture with opportunities for growth and advancementExciting projects with real-world impact at the forefront of MLOps innovationJoin Us: Ready to lead the charge in MLOps innovation? Apply now to join our team and shape the future of machine learning operations!",
    "postedDate": "2 months ago",
    "link": "https://www.linkedin.com/jobs/view/lead-ml-operations-engineer-mlops-at-unreal-staffing-inc-3897983139?position=58&pageNum=0&refId=b98zVd8fywwKP6YE3dmx8g%3D%3D&trackingId=Jbg7cnVzxVs9dr0BPav%2BqA%3D%3D&trk=public_jobs_jserp-result_search-card"
  },
  {
    "title": "N/A",
    "companyName": "N/A",
    "location": "N/A",
    "description": "N/A",
    "postedDate": "N/A",
    "link": "https://www.linkedin.com/jobs/view/staff-mlops-engineer-at-storm3-3955571679?position=59&pageNum=0&refId=b98zVd8fywwKP6YE3dmx8g%3D%3D&trackingId=eVLziKX3Gqvg4PCliLYfYQ%3D%3D&trk=public_jobs_jserp-result_search-card"
  },
  {
    "title": "N/A",
    "companyName": "N/A",
    "location": "N/A",
    "description": "N/A",
    "postedDate": "N/A",
    "link": "https://www.linkedin.com/jobs/view/mlops-engineer-with-google-vertiex-ai-at-hcl-global-systems-inc-3862182428?position=60&pageNum=0&refId=b98zVd8fywwKP6YE3dmx8g%3D%3D&trackingId=EGShA4KNyy8TU36wXpuA8Q%3D%3D&trk=public_jobs_jserp-result_search-card"
  }
]